In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [17]:
df=pd.read_csv("desktop/py_files/data/AB_NYC_2019.csv",usecols=["id","neighbourhood_group","price","room_type"])

In [18]:
df.head()

     id neighbourhood_group        room_type  price
0  2539            Brooklyn     Private room    149
1  2595           Manhattan  Entire home/apt    225
2  3647           Manhattan     Private room    150
3  3831            Brooklyn  Entire home/apt     89
4  5022           Manhattan  Entire home/apt     80

In [19]:
df.shape

(48895, 4)

In [20]:
df.describe()

                 id         price
count  4.889500e+04  48895.000000
mean   1.901714e+07    152.720687
std    1.098311e+07    240.154170
min    2.539000e+03      0.000000
25%    9.471945e+06     69.000000
50%    1.967728e+07    106.000000
75%    2.915218e+07    175.000000
max    3.648724e+07  10000.000000

In [26]:
min_thres,max_thres=df.price.quantile([0.1,0.95])
min_thres,max_thres

(49.0, 355.0)

In [28]:
df2=df[(df["price"]>min_thres) & (df["price"]<max_thres)]

In [30]:
df2.shape

(41417, 4)

In [ ]:
#we can see that our outliers rows has been removed.